# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect("data.sqlite", detect_types = sqlite3.PARSE_COLNAMES)

## Display the names of all the employees in Boston.

In [3]:
cur = conn.cursor()

In [11]:


cur.execute("""SELECT * FROM offices;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,,Chiyoda-Ku,Japan,102-8578,Japan

In [17]:
cur.execute("""SELECT * FROM employees;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

In [12]:
#Your code here
cur.execute("""SELECT lastName,firstName FROM employees
               JOIN offices
               using (officeCode)
               WHERE city = "Boston";""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?

In [16]:
#Your code here
cur.execute("""SELECT *
               FROM employees
               LEFT JOIN offices
               using (officeCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
print(len(df[df.officeCode.isnull()]))
df[df.officeCode.isnull()].head()

23
0

Empty DataFrame
Columns: [employeeNumber, lastName, firstName, extension, email, officeCode, reportsTo, jobTitle, city, phone, addressLine1, addressLine2, state, country, postalCode, territory]
Index: []

## Write 3 Questions of your own and answer them

In [ ]:
# How many direct reports does the President have? 
# Which office has the most people?
#Have any customers placed more than one order?

In [19]:
# Your code here
cur.execute("""SELECT jobtitle,COUNT(reportsTo)
               FROM employees
               GROUP BY reportsTo;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

       jobTitle  COUNT(reportsTo)
0     President                 1
1  VP Marketing                 2
2     Sales Rep                 4
3     Sales Rep                 3
4     Sales Rep                 6

In [21]:
# Your code here
cur.execute("""SELECT city, COUNT(employeeNumber)
               FROM employees
               JOIN offices
               using (officeCode)
               GROUP BY city;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

            city  COUNT(employeeNumber)
0         Boston                      2
1         London                      2
2            NYC                      2
3          Paris                      5
4  San Francisco                      6

In [23]:
# Your code here
cur.execute("""SELECT customerName, COUNT(orderNumber)
               FROM customers
               JOIN orders
               using (customerNumber)
               GROUP BY customerName
               ORDER BY count(orderNumber) DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                   customerName  COUNT(orderNumber)
0        Euro+ Shopping Channel                  26
1  Mini Gifts Distributors Ltd.                  17
2    Australian Collectors, Co.                   5
3      Danish Wholesale Imports                   5
4    Down Under Souveniers, Inc                   5

## Level Up: Display the names of each product each employee has sold.

In [25]:
# Your code here
cur.execute("""SELECT firstName, lastName, productName
               FROM employees e
               JOIN customers c
               on e.employeeNumber = c.SalesRepEmployeeNumber
               JOIN orders o
               USING (customerNumber)
               JOIN orderdetails od
               USING (orderNumber)
               JOIN products p
               USING (productCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [28]:
#Your code here
cur.execute("""SELECT firstName, lastName, COUNT(productName)
               FROM employees e
               JOIN customers c
               on e.employeeNumber = c.SalesRepEmployeeNumber
               JOIN orders o
               USING (customerNumber)
               JOIN orderdetails od
               USING (orderNumber)
               JOIN products p
               USING (productCode)
               GROUP BY employeeNumber
               ORDER BY count(productName) DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(20)

   firstName   lastName  COUNT(productName)
0     Gerard  Hernandez                 396
1     Leslie   Jennings                 331
2     Pamela   Castillo                 272
3      Larry       Bott                 236
4      Barry      Jones                 220
5     George     Vanauf                 211
6       Andy     Fixter                 185
7      Peter      Marsh                 185
8       Loui     Bondur                 177
9      Steve  Patterson                 152
10  Foon Yue      Tseng                 142
11      Mami      Nishi                 137
12     Julie   Firrelli                 124
13    Leslie   Thompson                 114
14    Martin     Gerard                 114

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!